Tekla Open API Reference for Tekla Structures 2025
SectionMarkTagAttributes Constructor
Overload List
Name | Description
SectionMarkBase.SectionMarkTagAttributes()
 Creates a new section mark tag attributes instance.
SectionMarkBase.SectionMarkTagAttributes(SectionMarkBase.SectionMarkTagAttributes.TagShowOnSide, TagLocation, Vector, SectionMarkBase.SectionMarkTagAttributes.TagTextRotation, ContainerElement)
 Creates a new section mark tag attributes instance with the given information.
Top
See Also
Reference
SectionMarkBase.SectionMarkTagAttributes Class
Tekla.Structures.Drawing Namespace